#!/usr/bin/python
# -*- coding: utf-8 -*-

#a############################################################################
#a########  "قُلۡ بِفَضلِ ٱللَّهِ وَبِرَحمَتِهِۦ فَبِذَٰلِكَ فَليَفرَحُواْ هُوَ خَيرُُ مِّمَّا يَجمَعُونَ"  #########
#a############################################################################

#a============================================================================
#a                       المشروع : وحدة استخراج الجذوع والجذور للكلمات العربية  
#a                                <asmaaarab@gmail.com>    المطور  : رغدي أحمد 
#a  http://www.ojuba.org/wiki/doku.php/waqf/license  الرخصة  : رخصة وقف العامة
#a============================================================================

#a============================================================================
#a                                  ـ الكلمة العربية المفردة لا تتجوز سبعة أحرف
#a        ـ الكلمة العربية لا تقل عن ثلاثة أحرف باستثناء الأدوات أو ماحذف منه حرف
#a                                  ـ الكلمة العربية المجردة لا تتجوز خمسة أحرف
#a                                              ـ أكثر الجذور في العربية ثلاثية
#a                                      ـ الحالات النادرة لا تعتبر في هذه الوحدة
#a============================================================================
#a      الجذع هو الكلمة المفردة أي غير المتصل بها كلمات لا في أولها ولا في آخرها
#a                            الجذوع هي الكلمات الناتجةعن حذف السوابق واللواحق
#a                                  مثال : بالاستخراج = استخراج ، يضربهن = يضرب
#a~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#a                              السوابق وهي الكلمات المتصلة بأول الكلمة الأصلية
#a                                          مثال الباء وال التعريف في : بالقلم
#a      استـ في كلمة استخرج ليست سابقة لأنها جزء من الكلمة وليست كلمة متصلة بها
#a                       ـ ما كان أوله ألفا ولاما ليس بعدها تاء فلا يكون إلا اسما
#a                                                ـ لا تدخل السين على غير الفعل
#a                                                 ـ العرف بأل لا تدخله اللواحق
#a                                             ـ لا تدخل حروف الجر على غير الاسم 
#a                           ـ تاء القسم لا تدخل على غير لفظ الجلالة واسم الرحمن
#a~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#a                              اللواحق وهي الكلمات المتصلة بآخر الكلمة الأصلية
#a                                                مثال الهاء والميم في : قلمهم
#a     الألف والتاء في مسلمات ليست لاحقة لأنها جزء من الكلمة وليست كلمة متصلة بها
#a                                     الياء دون نون الوقاية لا تلحق غير الأسماء
#a                  ـ يلحق الفعل ضمائر الرفع والنصب ونون الوقاية ونوني التوكيد
#a                                                ـ يلحق الاسماء ضمائر الجر فقط
#a============================================================================
#a                                      الجذر هو أصل الكلمة بدون الحروف المزيدة
#a    الحروف المزيدة هي حروف سألتمونيها مثل الألف في : قاعد ، والتاء في : فاطمة
#a                                                  مثال الجذر : استخراج = خرج
#a~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#a           ـ ما يزاد من الحروف أولا : ا،م،ه،ت،ن،ي،أ،إ،است،مست،تست،نست،يست،أست
#a                     مت،تت،نت،يت،أت،من،تن،نن،ين،أن
#a                                    ـ ما يزاد من الحروف حشوا : ا،م،ي،ت،و،ء،ن
#a                   ـ ما يزاد من الحروف أخيرا : ا،م،ت،و،ن،ى،ه،ة،ء،ات،ون،وا،ين
#a                          انة،نة،ان،اء،اءات،اوات
#a                         ـ اللام تزاد أخيرا في بضع كلمات والهاء في مادة أهراق
#a============================================================================

import re

#a مالا تقل عنه الكلمة العربية-------------------------------------------------

less_word = re.compile(u"يد|دم|فم|أب|أخ|حم|هن|([ا-ي][ا-ي]|آ)[ا-ي|\u0651]")

#a كلمات سوابق----------------------------------------------------------------

word_prefix = re.compile(u"^(?:ا?[وف]?((لل?|س)|([كبو]?(ال)?))?)")

#a كلمات لواحق----------------------------------------------------------------

word_suffix = re.compile(u"(?:(ت((م[او]?)|ن)?|(وا?))?(ن[اي]?)?([كه]((م?[او]?)|ن)?|نا)?([كه]((م?ا?)|ن)?|نا)?)$")

#a زوائد سابقة----------------------------------------------------------------

letter_prefix = re.compile(u"^(?:([اميت](ن|ت|ست)?)?)")

#a زوائد لاحقة-----------------------------------------------------------------

letter_suffix = re.compile(u"(?:(ي?((ا[تن]?)|([يو]?ن?)|ة)?)|(انة|اء|ا[ءو]ات)?)$")

#a زوائد متوسطة---------------------------------------------------------------

letter_on = re.compile(u"()")

#a حذف الكلمات السوابق المحتملة-------------------------------------------------------

def del_word_prefix(text):
    return word_prefix.sub(u'', text)

#a حذف الكلمات اللواحق المحتملة-------------------------------------------------------

def del_word_suffix(text):
    return word_suffix.sub(u'', text)

#a حذف الزوائد السوابق المحتملة-------------------------------------------------------

def del_letter_prefix(text):
    return letter_prefix.sub(u'', text)

#a حذف الزوائد اللواحق المحتملة-------------------------------------------------------

def del_letter_suffix(text):
    return letter_suffix.sub(u'', text)

#a حذف الزوائد المتوسطة المحتملة------------------------------------------------

def del_letter_on(text):
    return letter_on.sub(u'', text)
  
#a الجذع المحتمل----------------------------------------------------

def get_stem(text):
    text = del_word_suffix(text)
    text = del_word_prefix(text)
    text = del_letter_suffix(text)
    return del_letter_prefix(text)

#a الجذر المحتمل----------------------------------------------------

def get_root(text):
    return 

#def is_root(text):
#    if text in asm_roots.Roots: return True
#    else: return False

print (get_stem(u"النتوم"))